{
  "generatedAt": "2026-01-01T05:36:06.101Z",
  "substackUrl": "https://www.astralcodexten.com",
  "username": "Erusian",
  "count": 58,
  "rows": [
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192696581,
      "topLevelCommentId": 192696581,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192696581",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192696581",
      "commentDateMs": 1766986289690,
      "likes": 0,
      "text": "This seems like the kind of thing a universal policy would solve. Especially because babies are positive externalities anyway so you can justify putting public resources toward them."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192697331,
      "topLevelCommentId": 192697331,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192697331",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192697331",
      "commentDateMs": 1766986592005,
      "likes": 0,
      "text": "Over their lifetime they are still net positives economically."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192703222,
      "topLevelCommentId": 192703222,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192703222",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192703222",
      "commentDateMs": 1766989196255,
      "likes": 0,
      "text": "I'd need to nail down the claim more specifically. Do you just mean the concept of whether the median person produces more than a counterfactual where they don't exist?"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192704590,
      "topLevelCommentId": 192704590,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192704590",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192704590",
      "commentDateMs": 1766989803360,
      "likes": 0,
      "text": "Unfortunately, there are no separate stats on orphans, foundlings, or babies given up for adoption that I'm aware of. I am assuming that they roughly have similar income trajectories to either their mothers or the average/median person. If you have some evidence otherwise I'd be glad to see it. Otherwise I'm just inferring from the fact that the vast majority of able bodied people are net positives economically compared to the counterfactual where they never existed."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 193572170,
      "topLevelCommentId": 193572170,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/193572170",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/193572170",
      "commentDateMs": 1767194795079,
      "likes": 0,
      "text": "Thanks!"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192695823,
      "topLevelCommentId": 192695823,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192695823",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192695823",
      "commentDateMs": 1766985979065,
      "likes": 0,
      "text": "This is what Crisis Pregnancy Centers are designed to do. Basically discourage women from getting abortions by providing resources, care, etc. At least if you take them at their word."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192696309,
      "topLevelCommentId": 192696309,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192696309",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192696309",
      "commentDateMs": 1766986184392,
      "likes": 0,
      "text": "I don't actually know what they do. Just what both sides claim they do. And their supporters claim they give them fairly comprehensive services. The other side says roughly what you said."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192696829,
      "topLevelCommentId": 192696829,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192696829",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192696829",
      "commentDateMs": 1766986385245,
      "likes": 0,
      "text": "If you're dedicated then it's a very solved problem. Whatever else you can say about Trump, he thought both parties were terrible and he did something about it. Sanders too."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192846457,
      "topLevelCommentId": 192846457,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192846457",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192846457",
      "commentDateMs": 1767027761156,
      "likes": 0,
      "text": "I mean, Parliamentarian systems are pretty well covered by the standards comic.\n\nSituation: There are 14 competing left parties.\n\"Why do we have 14 competing left parties? We need one, big tent coalition party that synthesizes everyone's needs.\"\nSituation: There are 15 competing left parties.\n\nhttps://imgs.xkcd.com/comics/standards.png"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-414",
      "postTitle": "Open Thread 414",
      "postId": 182821604,
      "commentId": 192699246,
      "topLevelCommentId": 192699246,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192699246",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-414/comment/192699246",
      "commentDateMs": 1766987353710,
      "likes": 0,
      "text": "Threecan."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/against-against-boomers",
      "postTitle": "Against Against Boomers",
      "postId": 180400932,
      "commentId": 189628398,
      "topLevelCommentId": 189628398,
      "commentUrl": "https://www.astralcodexten.com/p/against-against-boomers/comment/189628398",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/against-against-boomers/comment/189628398",
      "commentDateMs": 1766167921105,
      "likes": 0,
      "text": "I basically agree with this. However, I will point out that every generation tends to have groups that vilify their parents so the trend isn't new. The boomers themselves used to say things like \"don't trust anyone over 30.\""
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188136898,
      "topLevelCommentId": 188136898,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188136898",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188136898",
      "commentDateMs": 1765825846266,
      "likes": 0,
      "text": "Free riding means benefiting from a shared resource, public good, or collective effort while paying for or contributing to its cost less than is fair or required. By this definition Europe was free riding because it benefitted from security and failed to meet its treaty obligations. In fact by this definition Europe is still free riding.\n\nYou're describing why it's rational to free ride. Basically, the US would keep global security and Europe could not help with that and only help with its immediate threats. See, for example, how France has repeatedly tried to undercut the US with China. Even after the Ukraine invasion and under Biden France insisted on saying it would not help the US defend Asian democracies."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188690612,
      "topLevelCommentId": 188690612,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188690612",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188690612",
      "commentDateMs": 1765949837034,
      "likes": 0,
      "text": "If you take Europe as a whole they failed however. But I take the point that specific nations did not, though even most of them only after 2014. But still, I give them credit for that and would prefer the US was higher resolution."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188320152,
      "topLevelCommentId": 188320152,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188320152",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188320152",
      "commentDateMs": 1765866434110,
      "likes": 0,
      "text": "> Europe is free riding global security as much as China, Japan, Brazil, Saudi Arabia or anyone else does.\n\nWe don't ship weapons to China or aided them in securing their borders or were giving them military assistance in Myanmar. Nor equivalently for Brazil. We give Saudi Arabia a lesser amount of help because it's not an ally. Japan you're right about. Though it's still slightly lesser because, unlike Europe, they didn't agree to certain contributions then ignore them.\n\n> After 9/11 European allies helped the US in Afghanistan, the attack having been in the specified area.\n\nYes. And the US has given more to Ukraine than the EU gave to the entire war on terror despite the US having no treaty obligation to Ukraine. Therefore, why do Europeans have any objection to the US pulling back? Because alliances are more than legalism.\n\n> However, during the Falkland war US did not intervene directly as that not included in the area.\n\nThe US did, however, back Britain and supply refueling, intelligence, weapons, and Britain refused further help.\n\n> Until the 20th century the US was free riding the global security maintained by the British Empire the same way.\n\nThe British Empire was a security threat to the United States, not a net contributor, until after WW2.\n\n> If there is a war against Russia in Europe, would you expect Taiwan, South Korea and Japan to contribute forces?\n\nYes.\n\n> If they are not inclined to do that, are they also free riding their alliance with the US?\n\nYes.\n\n> How about the gulf states that host US military bases, were defended by the US in 1991 and most likely would receive US help in case of a war with Iran? Are they expected to help against China and Russia if it comes to it?\n\nYes."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188457302,
      "topLevelCommentId": 188457302,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188457302",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188457302",
      "commentDateMs": 1765902189599,
      "likes": 0,
      "text": "> China would also describe the US as a security threat for the past 80 years, yet the rise of China would have been impossible without global trade security maintained by the US.\n\nYes. And if the British had had primary responsibility for policing American trade, and had not started wars or attacked the United States, the situations might be symmetrical. Likewise if Britain had helped the US rather than selling weapons to the Confederacy or other nations the US was at war with or providing them diplomatic cover. Britain was much less benign to the US in the 19th century than the US was to China.\n\n> The US did not help Ukraine to help Europe.\n\nYou are now arguing intentions to get around the simple fact that the statement is true. The US has done more to help Ukraine than Europe did to help in the war on terror despite Europe being treaty bound and the US not being treaty bound to help Ukraine. I could equally argue Europe got into the war on terror not to help the US but to prevent, and later avenge, their own terrorist attacks. Which did happen. I don't make such an argument though because I'm consistent about this.\n\n> In 1991 the US deployed forces to defend Saudi Arabia from a potential invasion, and helped freeing a Saudi town Iraq captured with actual American boots on the ground, and was the primary force that smashed the Iraqi army and liberated Kuwait. This is certainly larger contribution than what Europe got since WW2.\n\nSaudi Arabia allowed US troops into the country to help with the planned liberation of Kuwait which was an ally. And the idea Desert Storm was a bigger contribution than what Europe got is absurd. First, it was just monetarily less costly (though with inflation more costly) than Ukraine has gotten. Secondly US forces in Europe have been there longer over the entire period such that it adds up to a much bigger commitment. There are US troops in Europe right now to stave off invasion.\n\n> I am pretty sure Europe would provide such too.\n\nWhile I disagree with a fair amount of specifics, I agree Europe feels the US has been behaving badly. And in some ways are correct. However, Europe is behaving worse than the US even under Trump. Though the US is by no means perfect or innocent.\n\n> I think Taiwan, Japan or the Gulf states have a very different understanding about sending forces to a potential war against Russia (or in the case of the latter, against China too), and their median citizen or even politician would be surprised and less likely to do that than most Europeans.\n\nI disagree. The point about Russia is particularly ill taken considering Japan and South Korea have disputes with Russia and have been threatened by them. A fact the Europeans neither seem aware of or interested in."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188689508,
      "topLevelCommentId": 188689508,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188689508",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188689508",
      "commentDateMs": 1765949409567,
      "likes": 0,
      "text": "> I dispute this, although such things are difficult to measure.\n\nThe British burned down the American capital and did several other fairly hostile things. Also the territory Britain managed to keep during the American Revolution was never reclaimed. It makes up several commonwealth nations. And Britain was adding to it for almost a century afterward. But the US hasn't constructed a grievance narrative out of it.\n\n> And of course there was the Korean war with hundreds of thousands of Chinese casualties.\n\nYes, China lost soldiers intervening in a war against the United States. A war which the side China intervened to help started.\n\n> They have been in Europe longer, but there have never been as many US troops in Europe (since WW2) as what were deployed for the Gulf War\n\nDesert Storm had 470,000 troops and about 700,000 total American personnel. Europe had 300-500,000 troops and significantly more non-combat personnel up until 1990-ish when it was reduced. So if it's true it's not true by much. I agree it's different but I think standing off against a superpower with nukes is the more threatening thing.\n\n> My thesis is that the US had been doing that all around the world through much of the 20th and 21th century, and Europe is not an outlier in receiving that.\n\nIf this were true you could find similar sustained engagements around the world. You can in Japan and South Korea and basically nowhere else. There are other examples but they fail on timeline and scale.\n\n> If anything, Europe helped more in US adventures than other countries.\n\nSeveral of these are Europe defending its own colonies or international influence. The idea that France was in (say) Niger or opposing Russia there because of the US is wrong. \"More\" may be true depending on the comparison. I agree that European allies, while not perfect, have not been as bad as many in Trump's orbit think. I agree completely with this statement:\n\"Could European countries be a better allies? Sure. But a lot of them are already among the best the US has, and certainly the worst ones are not in Europe.\"\n\n> Whatever it is though, I doubt it would be worse\n\n\"I don't know what you're talking about but I'm right anyway\" is a sign you're not really open to persuasion. But the likely disagreement is I basically think that actions are more important than words and that Trump saying stuff which is not translated into policy is weighed too heavily."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188320760,
      "topLevelCommentId": 188320760,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188320760",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188320760",
      "commentDateMs": 1765866674017,
      "likes": 0,
      "text": "I'm not sure what distinction you're trying to draw. There's a public good here and whether you define it as \"global security\" or \"security in Europe and North America\" doesn't seem especially salient to me. In either case, Europe was not contributing enough for either.\n\nMy position is: if you make an agreement, the other side keeps it, you do not, and you benefit from them keeping the agreement then you are free riding. If Europe didn't wish to make the agreement it was free not to and to bear the consequences of that.\n\nI am easier on Japan because they did not make such an agreement. So while I think they also acted in ways that weren't ideal they get off easier than Europe. I'm also especially frustrated with Europe's constant attempts to directly undermine American security and hypocrisy on the economic and political front in ways that don't really apply to Japan (but do to some extent apply to South Korea)."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188459313,
      "topLevelCommentId": 188459313,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188459313",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188459313",
      "commentDateMs": 1765902506072,
      "likes": 0,
      "text": "So your position is that Europe making a promise to the United States in a signed document and then failing to fulfill it doesn't count unless it's in the NATO charter? And that nothing in NATO beyond the charter exists? This is a narrow interpretation of what NATO is that you likely haven't thought through the implications of. Also, various European nations did promise to help the US with China or the Pacific then welched.\n\nI don't think either the US or Europe has an obligation to maintain general global security. I do think they owe a duty to maintaining general alliance security including countries outside NATO but inside the alliance system. I think the US acts this way and Europe doesn't but benefits from the US acting this way. For example, the US has very little shipping through the Red Sea. That was done almost entirely for Europe's benefit."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188690410,
      "topLevelCommentId": 188690410,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188690410",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188690410",
      "commentDateMs": 1765949760543,
      "likes": 0,
      "text": "> It is my impression - and please correct me if I'm wrong - that you're unhappy with Europe on a larger scale than that, that you feel Europe should participate in protecting the world order it profits from.\n\nNot specifically. Europe ought to participate to the maintenance of broad alliance security. This does expand beyond the reaches of NATO. For example, I want them to be contributing with policing piracy in the Red Sea and the defense of Japan. As well as economic things like avoiding ostpolitik. But it does not mean they're required to be concerned with global order writ large.\n\n> So if you have a link to that or some starting point for me to go on and my own research, I'd be interested :)\n\nThe Prague Summit, Riga Summit, and Wales Summit all produced documents of varying language which all sides agreed to. They were not binding treaties. However, they were treated as agreements and members were criticized and called out as a problem at subsequent summits for failing to meet the goals. And the US threatened to withdraw support and did not on the basis of these promises."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 189375241,
      "topLevelCommentId": 189375241,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/189375241",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/189375241",
      "commentDateMs": 1766103712143,
      "likes": 0,
      "text": "No problem. There was a period where the European case of \"we all agreed to spend less\" was true. It's just that it was from roughly 1992 to 2006. Or 2002, depending on what you consider an agreement vs guideline vs whatever. But definitely from 2006 there was a 2% spending pledge which Europe has never hit. The US has been complaining about this since 2002 at any rate."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188461063,
      "topLevelCommentId": 188461063,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188461063",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188461063",
      "commentDateMs": 1765902764600,
      "likes": 0,
      "text": "> Is your primary crux about the 2% spending that a lot of other NATO countries did not meet (and some still don't)?\n\nNo but it's one of the more salient examples of my wider point.\n\n> What do you mean here exactly?\n\nVarious ostpolitik and pro-Chinese or Iranian moves by the EU and individual nations.\n\n> In any case, I think what would make the issue clearer is if we stopped referring to countries that are part of NATO but not US or Canada as \"Europe\".\n\nI agree with this point in aggregate. The issue is that it's a minority of nations and an even smaller minority of population and economic heft. Also I don't like how Europe sometimes plays a game where they're Europe when it's convenient and individual nations when it's convenient. But broadly I do prefer a system where we acknowledge individual nation's successes or failures until such time as the EU has national economic or military policy. Which it doesn't."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188156723,
      "topLevelCommentId": 188156723,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188156723",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188156723",
      "commentDateMs": 1765829123341,
      "likes": 0,
      "text": "So, to be clear, your position is that the US is obligated to help Europe against Russia but Europe is not obligated to help the US against China? Or to enforce international law when China violates it? Because that's what Trump says Europeans believe and it's how he justifies his actions."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188159101,
      "topLevelCommentId": 188159101,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188159101",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188159101",
      "commentDateMs": 1765829507548,
      "likes": 0,
      "text": "Alright, given that's Europe's intention, why should the US not immediately break all its treaties with Europe and side with Russia? Why should it not help Russia against Ukraine? The US could forbid Europe from sending arms tomorrow and send them to Russia.\n\nI don't think that is Europe's intention. But such arguments invariably count on: the US protects us until we're ready to stab them in the back. Which says something quite nasty about Europeans who argue for it."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/open-thread-412",
      "postTitle": "Open Thread 412",
      "postId": 181685775,
      "commentId": 188166882,
      "topLevelCommentId": 188166882,
      "commentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188166882",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/open-thread-412/comment/188166882",
      "commentDateMs": 1765830788350,
      "likes": 0,
      "text": "This is a great example of the strategic myopia your view relies on. Saying that Europe should side with China against the US but if I talk about the US doing the same \"boy, the gloves are off.\" Being treated equally feels like threat because you're so used to the US acting in Europe's interest.\n\nAnyway, Europe is free to choose its own foreign policy. It always has been because it is not, contrary to your claims, a vassal. It is not free to choose the RESULTS of its foreign policy and I can say that such a foreign policy would be disastrous for Europe."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186400523,
      "topLevelCommentId": 186400523,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186400523",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186400523",
      "commentDateMs": 1765398125099,
      "likes": 0,
      "text": "52. Generally speaking, apocalypse cults do not claim everything will mostly stay the same. Apocalypse is kind of a load bearing part of the claim. You can I guess claim almost everyone is in a \"things will mostly continue roughly as they have before\" cult and have been for much of history. This is actually kind of important to understand the cyclical nature of premodern society in particular, before the cultural idea of technological progress had really been invented."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186447685,
      "topLevelCommentId": 186447685,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186447685",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186447685",
      "commentDateMs": 1765406342786,
      "likes": 0,
      "text": "It is, to be honest, the kind of thing you only find funny if you already have the proper beliefs to make you agree with it."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186399804,
      "topLevelCommentId": 186399804,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186399804",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186399804",
      "commentDateMs": 1765398010356,
      "likes": 0,
      "text": "23. I've heard this accusation made. I originally said I've been consistent on this. But I've now realized: so is everyone else in this camp that I know. So can you point to anyone who wants a lack of AI regulation but also wants to sell the chips to China? David Sacks wanted the Federal pre-emption and a regulatory structure like the one he made for crypto. So he doesn't count. Who else?"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186399426,
      "topLevelCommentId": 186399426,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186399426",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186399426",
      "commentDateMs": 1765397950273,
      "likes": 0,
      "text": "22. I strongly suspect you're overestimating the yearning for regulation, especially regulation made in California that has national effects. I in general have a low opinion of that cohort's political instincts. But we'll see I suppose."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186398973,
      "topLevelCommentId": 186398973,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186398973",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186398973",
      "commentDateMs": 1765397876103,
      "likes": 0,
      "text": "46. Yeah, that's wrong. I've been having this argument since Sudan started. The US has MORE influence over the UAE than Israel. This is just an excuse to cover up some mysterious, third reason for caring about one and not the other.\n\n1. Israel and the UAE have the same status relative to the US, a Major Non-NATO Ally.\n2. The US has no military base in Israel, just a small coordination center. It has a major military and air base in the UAE.\n3. Israel has its own missile defenses and arms industry. The UAE largely doesn't and relies on US protection from Iran both geopolitically and simply against missiles and boats.\n4. Since 2024, pro-Israel lobbying spent $6.5 million dollars while the UAE over the same period spent $24 million. If you add up other categories of spending the gap widens because of the UAE funding non-profits, think tanks, Middle Eastern studies programs at universities, etc etc.\n5. While the US does sell more arms to Israel it still sells billions to tens of billions to the UAE and it has MORE chokepoints without alternatives."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186773709,
      "topLevelCommentId": 186773709,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186773709",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186773709",
      "commentDateMs": 1765483695787,
      "likes": 0,
      "text": "For the same reason I'm excluding CAIR and other domestic political organizations. They're lobbying by a domestic group. The only way they get counted as pro-Israeli is if you contend that Americans Jews lobbying are inherently pro-Israel. Which is a rather difficult case to make unless you think all American Jews are representatives of Israel."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186879030,
      "topLevelCommentId": 186879030,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186879030",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186879030",
      "commentDateMs": 1765504967522,
      "likes": 0,
      "text": "We could rerun the numbers including things like spending by domestic groups, investments in think tanks and universities, etc etc to get a more comprehensive picture. Generally speaking Arabs come out ahead due to a combination of raw size and oil money. But that does create a more comprehensive picture.\n\nBut fair nitpick that there is domestic lobbying done by Americans who support foreign countries. This is distinct from foreign lobbying though."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186524968,
      "topLevelCommentId": 186524968,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186524968",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186524968",
      "commentDateMs": 1765424248328,
      "likes": 0,
      "text": "What do you mean by \"culturally\"? The UAE has more expats in it and has a much more foreign media ecosystem. If you just mean the UAE is not western then I guess it depends on your definition of western but I don't tend to think that's a valid mode of analysis. What are you imagining here in either country?\n\nAnyway, I agree the UAE is not the one carrying out the acts. However, the west isn't carrying out the acts in Israel either. And western weapons are being sent into Sudan through them. Wasn't that what Gaza was supposed to mechanically do? Sanctions and weapons cut offs? That was the idea. Great, do that about Sudan and its backers (including Russia etc). Great first step (and I mean that sincerely.) And even if you just care about Gaza doesn't setting the precedent help?\n\nWhen people say \"not comparable\" what that usually means is \"comparing them makes my argument look bad so I'm going to declare it impossible.\" Not that things can't be different but you can always compare. You can compare a fish and an airplane. You'll just find they're very different."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186878378,
      "topLevelCommentId": 186878378,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186878378",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186878378",
      "commentDateMs": 1765504812389,
      "likes": 0,
      "text": "The original point is extremely unclear on the causal mechanism it's proposing so I might be off the mark in my reply."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186467918,
      "topLevelCommentId": 186467918,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186467918",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186467918",
      "commentDateMs": 1765410497065,
      "likes": 0,
      "text": "Israel was maintaining close ties with Russia until Russia sided with the forces that attacked them on October 7th and invited several leaders of anti-Israeli organizations' leaders to the Kremlin. The Israelis also had begun to cultivate ties with China. Both effectively abandoned them to choose Iran. They did the same to Saudi Arabia, by the way. It's possible that the Israeli public has a deep an abiding affection for the EU such that they would be upset with their government for pivoting away. But honestly I haven't seen signs of it.\n\nThe UAE has also done some balancing. But the idea that Israel couldn't switch patrons was always something that some people wanted to be true (because it meant the US had control) rather than true. In fact Israel's original security patron was the USSR.\n\nThe 50+% stat only works if you include more than the US and EU. And if you include the same countries you get something like 40% of the UAE. And the UAE is more dependent on trade overall. The percentage of GDP represented by trade is 202% for UAE vs 57% for Israel. Their government revenues (the ones they use to fund the conflict) are also largely done from oil purchases many of which go west. And they need to buy the weapons too with limited domestic production. So yeah, the UAE is FAR more exposed to sanctions and trade influence than Israel. Though Israel is exposed too. Just far less than the UAE.\n\nIt's convenient for many people to pretend Israel is unusually dependent on the west. But it's not unusually dependent. This doesn't mean there's not significant influence (there is) but in the absence of western patronage it would simply reorient."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186523794,
      "topLevelCommentId": 186523794,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186523794",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186523794",
      "commentDateMs": 1765423910724,
      "likes": 0,
      "text": "I don't know what oec.world is but its numbers seem very different from the data I've seen elsewhere. Where is it from?"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186774187,
      "topLevelCommentId": 186774187,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186774187",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186774187",
      "commentDateMs": 1765483780938,
      "likes": 0,
      "text": "Thanks. These numbers are far off both from what I have and from each other. I'll look into it again, I might be wrong. I am still fairly certain about the situation with regards to weapons though."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186447512,
      "topLevelCommentId": 186447512,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186447512",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186447512",
      "commentDateMs": 1765406306094,
      "likes": 0,
      "text": "One of the great frustrations is genuinely caring for something which then becomes briefly the current issue, a bunch of people pour in, then pour out again with not the slightest care for the wider cause. Because it's different on these narrow grounds you see. But really it's that it's no longer the current thing."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186446926,
      "topLevelCommentId": 186446926,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186446926",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186446926",
      "commentDateMs": 1765406196985,
      "likes": 0,
      "text": "This isn't a response to something I claimed. But the US does do research in Israel and uses research abroad in several countries (including, strangely, China) to get around such restrictions."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 187207876,
      "topLevelCommentId": 187207876,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/187207876",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/187207876",
      "commentDateMs": 1765582561590,
      "likes": 0,
      "text": "The US does not have a single warplane in Israel. Aircraft carriers are generally mobile and they always carry aircraft. You are likely badly mangling the old appellation of islands that have US airbases as \"unsinkable aircraft carriers.\" But Israel isn't an island either.\n\nIron Dome is not solely an American made product. It's a joint collaboration. It's also purely defensive. And that still makes it less central than the UAE which uses actual American missiles fired by Americans from American bases."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184216794,
      "topLevelCommentId": 184216794,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184216794",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184216794",
      "commentDateMs": 1764872105743,
      "likes": 0,
      "text": "I think I figured out something which explains it: if you disaggregate you find that what happened is that the medians/averages conceal massively uneven statistics.\n\nRedistribution by the Democrats such that things got better for classes that benefitted from government spending (mainly those in NGO world, climate companies, government employees, teachers, small businesses eligible for grants which were disproportionately women/minorities, etc) and worse for everyone else. I suspect this was a big driver. Inflation was effectively a universal tax which was then redistributed by Democrat rescue packages to their constituencies. Which they in effect said: that they were targeting help at the vulnerable who were, for the most part, by historical disadvantage (ie, Democratic priorities) rather than needs based. They explicitly said they saw it as a way to reduce disparities. It doesn't help they got very indulgent with targeted giveaways even to their rich constituents (SALT, student debt).\n\nThis naturally upset everyone not on the receiving end of such largesse who saw real loss of purchasing power. The Democrats basically gave themselves credit for aggregate statistics and thought they could ignore the people who were losing from their policies because they were politically disfavored. This seems to be a common malady in their decision making which Bill Clinton and Obama have both commented on.\n\nWe're seeing a similar thing with Trump's policies right now, by the way. Different specifics but still."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184528117,
      "topLevelCommentId": 184528117,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184528117",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184528117",
      "commentDateMs": 1764947931710,
      "likes": 0,
      "text": "This was the Biden administration talking point. It was not, however, true. What the Biden admin claimed a few times is that by 2022-3 certain groups of bottom quartile workers had real higher wage growth than pre-pandemic trends (about double what the top quartile got). They were quite proud of the fact they avoided a recovery where the rich got an equal or greater share. This is evidence for my hypothesis."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184404582,
      "topLevelCommentId": 184404582,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184404582",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184404582",
      "commentDateMs": 1764910095530,
      "likes": 0,
      "text": "This is mathematically true. However, it's also irrelevant, as real wages did not improve but actually declined slightly. And I'm contending within that the composition of where people were along the rank ordering (which medians create) changed significantly through redistribution. Which logically you must accept if you accept Biden's programs worked to accomplish their stated goals."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184530426,
      "topLevelCommentId": 184530426,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184530426",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184530426",
      "commentDateMs": 1764948278891,
      "likes": 0,
      "text": "Another chart shows them declining slightly. But fair point that I overstated. At any rate, I'll accept \"roughly stagnated.\" Whether they grew slightly or declined slightly so long as they roughly stayed the same that's sufficient.\n\nMy baseline prediction is doubling the Federal budget in giveaways has macroeconomic effects. It may not have been good policy but the people who were given the money received the money and thus changed their income level. I agree that median is zero sum and this is my point: if the median stayed roughly the same and one group was given huge giveaways then in order for the median to stay the same other people have to decline.\n\nI agree that housing costs drive all kinds of economic issues and people would have been happier with lower costs. However, I think this started prepandemic and so you can't explain the change by it. Permanent increase in service jobs pay, meanwhile, should have had effects we don't see. As to social media, I haven't looked into it but I'm default suspicious of blaming new media for social ills when we're in the grip of a panic about it. I acknowledge that's not a fully good reason but \"you have it good, Instagram just makes you envious\" strikes me as dismissive at best."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 186388729,
      "topLevelCommentId": 186388729,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/186388729",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/186388729",
      "commentDateMs": 1765396103146,
      "likes": 0,
      "text": "Normal evidence but to a higher standard such that it would not have given a false positive to a reasonable expert in the height of another moral panic. And while the boy who cried wolf doesn't remain silent a significant majority of the cries are false such that any individual call is likely false."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184225863,
      "topLevelCommentId": 184225863,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184225863",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184225863",
      "commentDateMs": 1764873518849,
      "likes": 0,
      "text": "> It looks to me like the story is the same for white people as for the population in general. For men with no college degree, income dropped throughout the 2000s, then started increasing again after 2012, which is the opposite of what your story would predict.\n\nThat isn't what my argument would predict. You are making this into a broad racial argument when it's about what sector of the economy you participate in and where you live. A Black woman who works at a mid-sized business in Alabama is in the losers category. But you are reproducing the issue with Blue thinking that lead to the error in the first place. In fact my argument leads to an explanation for race depolarization as the effectively economic class based nature (which does not mean income but how you related to the economy) gave a common class interest to many groups.\n\n> If the Democrats are funneling money from Group A to Group B, then either Group A is bigger, or Group B is bigger. If Group A was bigger, then this would look like falling median wages (instead of rising).\n\nMedian and average wages stagnated or declined slightly under Biden. Links to graphs below. My contention is that this concealed significant changes in who was where because inflation was a universal tax and then spending unevenly supported everyone. This is, if you take a less rosy view of it, what the Biden administration said they intended to do with rhetoric about racial equality or fighting inequality. To change the composition of wealth in the country. You may support that but naturally the losers of that process would be upset.\n\nhttps://cdn.factcheck.org/UploadedFiles/image-22-593x355.png\nhttps://cdn.statcdn.com/Infographic/images/normal/33790.jpeg\nhttps://epicforamerica.org/wp-content/uploads/2024/10/Real-Wages-Graph.png"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184526509,
      "topLevelCommentId": 184526509,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184526509",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184526509",
      "commentDateMs": 1764947683353,
      "likes": 0,
      "text": "I specifically called out compositional effects. So this is not actually a good counterargument because people did not return to the same mix of jobs pre and post-pandemic and payscales changed unevenly."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184407134,
      "topLevelCommentId": 184407134,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184407134",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184407134",
      "commentDateMs": 1764910987269,
      "likes": 0,
      "text": "I suspect because your chart is a subset of workers rather than all workers or all people/households. The Democrats under the Biden administration did this a lot. During the pandemic, for example, I remember they released a stat showing basically real wages were up by limiting it to the durable goods sector which was then experiencing a boom. In your case, that chart still shows relatively flat growth during the Biden years. But also it excludes:\nGovernment workers\nFarm and rural workers (perhaps important to understand Trump?)\nSelf-employed people, contractors, and many small business owners\nPrivate household employers\nRetired and fixed income people\nAnd potentially others but definitely those.\n\nThis is approximately a third of the workforce and an additional over 20% of the population that is retired etc and so not in the workforce. So in fact a slight majority or close to it.\n\n(I will note, in the interest of completeness, that my theory does not predict \"included in your graph/not included\" as the relevant division.)\n\nReal wages went up during the pandemic because pandemics cause labor shortages and because people who don't show up to work drop out of the labor force unless paid more to take on the risk. Additionally laptop jobs tend to be higher productivity and were less disrupted than low productivity stuff like restaurants. Compositional effects. I suspect that's why your chart shows it going down as well."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181272833,
      "topLevelCommentId": 181272833,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181272833",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181272833",
      "commentDateMs": 1764123125875,
      "likes": 0,
      "text": "> The Chinese dont really believe in recursive self-improvement or superintelligence.\n\nGood to see you now agree that rationalist AI risk is a niche concern compared to other forms of AI risk about concerns like political control. China actually has an extremely robust AI risk infrastructure meant to prevent it from harming the government. Has the fact that AI risk almost invariably has turned to political control made you rethink your positions at all? This isn't a gotcha, I genuinely find the degree to which the AI Risk community seems to not engage with this kind of stuff frustrating and if you want to point me to the smart rationalists who have thought about other ideologies in the space I'd be curious to read it.\n\n> Is there a risk that the next generation of AI safety regulations will be more burdensome? From what I hear, if we win this round beyond our expectations, the next generation of AI safety asks is third-party safety auditing and location verification for chips. I dont know the exact details, but these dont seem order-of-magnitude worse than the current bills. Maybe another 1%.\n\nThis is MUCH MUCH more burdensome than another 1% and would require re-engineering the entire way chip sales and data centers work. The fact this is casually suggested without taking that into account does not inspire confidence. Though there's a chance we're going to do that anyway as part of an export control regime. It's not that I think it's not doable but the fact this is where you ended up as a cost estimate is a red flag to me.\n\n> Most people who discuss this want a mutual pause.\n\nYou suggested a unilateral pause in the comments of this blog. Are you willing to now commit to not supporting any unilateral pause? Because I'm not opposed to some form of cooperation. But I'm absolutely opposed to a unilateral pause.\n\n> Consider AI ethics regulations like the Colorado AI Act of 2024. It legislates that any institution which uses AI to make decisions (schools, hospitals, businesses, etc) must perform yearly impact assessments evaluating whether the models might engage in algorithmic discrimination, a poorly-defined concept from the 2010s that doesnt really make sense in reference to modern language models.\n> If the US knows about Chinese chip smuggling strategies, why cant it crack down?\n\nThis is something I don't understand from a political perspective. There's multiple groups trying to constrain AI in various ways. Many of them are far more powerful than rationalists. The degree to which rationalists seem to not realize this is happening is baffling to me. Obviously the answer would be to hitch the relatively niche, unpopular policies they want to a wider vehicle that does have a larger support base.\n\n> Yet some of the loudest voices warning against AI safety regulation on race with China grounds support NVIDIA chip exports!\n\nFor what it's worth this doesn't apply to me.\n\n> But Ill go further and say its too early even to know what the sign of AI safety regulations is; whether they might actually speed us up relative to China.\n\nThis has been tried by Europe. It did not work. This doesn't mean in principle it can't work. But it means you have a very heavy burden of proof.\n\n> Third, China is having its own debate over whether it can prioritize safety without losing the race against America!\n\nKind of. There are people quietly pointing out that political restrictions are causing issues. Sometimes they win a little but ultimately security leads all right now. Also, don't underestimate the degree to which China will consciously manipulate foreign movements to serve its own goals. The individual Chinese scientists might be entirely sincere, in fact the whole organization might be, but the government might fund and push them forward with explicitly political motives.\n\nThere is an easy test though: make sure they are not asking for unilateral concessions where you pause or limit yourself for future promises China will \"follow along\" or other such things. Which is tempting because they will point out how China's system makes influence harder. Which is true but is being weaponized in that case.\n\n> When the wind changes, and the position of industry leaders changes with it, you may be glad to have us around.\n\nThe Biden Executive Order and the general work of Democratic staffers has not inspired confidence. Your movement, such as it is, should be producing competent staffers that can go into government and coordinating political organizations to mobilize votes and donations and other such candidate support. I have not seen this."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181824203,
      "topLevelCommentId": 181824203,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181824203",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181824203",
      "commentDateMs": 1764265553801,
      "likes": 0,
      "text": "As I said above: I think you misunderstand my point which is not \"not many people care about this\" but \"the way you analyze this is strange, out of step with how everyone else sees the same problem, etc.\" most of the world (including most computer scientists) simply do not agree that rationalist style AI risk exists. It's virtually absent outside of a few western subcultures.\n\nAnyway, you want to find sources that say AI was held back not by generic regulations but by specific regulations on AI? That seems very much like the burden of proof should be on you to prove. To first effect, \"the significant regulations on AI are the primary thing affecting AI\" seems like the null hypothesis.\n\nAnyway, the EU politicians themselves say they should roll them back and they stifled growth. It's all over the news right now. Here's the first article from Google:\nhttps://www.theguardian.com/technology/2025/nov/24/us-europe-artificial-intelligence-ai"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181951631,
      "topLevelCommentId": 181951631,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181951631",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181951631",
      "commentDateMs": 1764299824570,
      "likes": 0,
      "text": "Yeah, they think the entire chain of reasoning is flawed. They acknowledge basic risks like job loss or security issues. Most do not think there's any chance of it replacing people. Those that do almost invariably have received it from actually participating in western AI risk communities of various types. There's not even a standard term for existential risk in several languages. The calque it."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 182994961,
      "topLevelCommentId": 182994961,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/182994961",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/182994961",
      "commentDateMs": 1764597867113,
      "likes": 0,
      "text": "Which languages? Can you please show me the research institutes doing work in these third world languages about rationalist style X-Risk? Or even just extensive discourse."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181823434,
      "topLevelCommentId": 181823434,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181823434",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181823434",
      "commentDateMs": 1764265409237,
      "likes": 0,
      "text": "I think you misunderstand my point which is not \"not many people care about this\" but \"the way you analyze this is strange, out of step with how everyone else sees the same problem, etc.\"\n\nI agree that just because a problem is hard you shouldn't abandon it. However, most of the world (including most computer scientists) simply do not agree that rationalist style AI risk exists. It's virtually absent outside of a few western subcultures."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181699302,
      "topLevelCommentId": 181699302,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181699302",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181699302",
      "commentDateMs": 1764237134284,
      "likes": 0,
      "text": "https://artificialintelligenceact.eu/\n\nThe EU specifically claimed the act would help them compete in AI. It is now widely believed to be a reason why the EU has such a weak AI industry. You can disagree with that being the cause. But objectively the EU is weaker in AI than you'd expect from pure economic or scientific output."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181287707,
      "topLevelCommentId": 181287707,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181287707",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181287707",
      "commentDateMs": 1764127121952,
      "likes": 0,
      "text": "Care to make a prediction market bet on AI killing every person in the United States and China within, say, the next five years? What odds would you need?"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181300343,
      "topLevelCommentId": 181300343,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181300343",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181300343",
      "commentDateMs": 1764131039353,
      "likes": 0,
      "text": "If I could be convinced of the other person not reneging I'd agree to this. Though I'd expect the time value of money to be calculated in as part of the odds."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181284145,
      "topLevelCommentId": 181284145,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181284145",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181284145",
      "commentDateMs": 1764126108874,
      "likes": 0,
      "text": "What parts do you disagree with? And yeah, the estimates skew very low based on the asks."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181300632,
      "topLevelCommentId": 181300632,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181300632",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181300632",
      "commentDateMs": 1764131135035,
      "likes": 0,
      "text": "Granting the runaway AGI scenarios you're gesturing toward: I'd rather have AGI controlled by the CCP than controlled by nobody. But I'd rather have AGI controlled by the US than controlled by the CCP. However, I think China is also entirely capable of creating AI controlled by nobody."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181313533,
      "topLevelCommentId": 181313533,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181313533",
      "topLevelCommentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181313533",
      "commentDateMs": 1764136196428,
      "likes": 0,
      "text": "I'm granting the runaway AGI premise that it's an existential risk to humanity. The CCP wants humanity to continue to exist."
    }
  ]
}