{
  "generatedAt": "2026-01-01T04:21:57.025Z",
  "substackUrl": "https://www.astralcodexten.com",
  "username": "Erusian",
  "count": 7,
  "rows": [
    {
      "postUrl": "https://www.astralcodexten.com/p/against-against-boomers",
      "postTitle": "Against Against Boomers",
      "postId": 180400932,
      "commentId": 189628398,
      "commentUrl": "https://www.astralcodexten.com/p/against-against-boomers/comment/189628398",
      "commentDateMs": 1766167921105,
      "likes": 0,
      "text": "I basically agree with this. However, I will point out that every generation tends to have groups that vilify their parents so the trend isn't new. The boomers themselves used to say things like \"don't trust anyone over 30.\""
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186398973,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186398973",
      "commentDateMs": 1765397876103,
      "likes": 0,
      "text": "46. Yeah, that's wrong. I've been having this argument since Sudan started. The US has MORE influence over the UAE than Israel. This is just an excuse to cover up some mysterious, third reason for caring about one and not the other. 1. Israel and the UAE have the same status relative to the US, a Major Non-NATO Ally. 2. The US has no military base in Israel, just a small coordination center. It has a major military and air base in the UAE. 3. Israel has its own missile defenses and arms industry. The UAE largely doesn't and relies on US protection from Iran both geopolitically and simply against missiles and boats. 4. Since 2024, pro-Israel lobbying spent $6.5 million dollars while the UAE over the same period spent $24 million. If you add up other categories of spending the gap widens because of the UAE funding non-profits, think tanks, Middle Eastern studies programs at universities, etc etc. 5. While the US does sell more arms to Israel it still sells billions to tens of billions to the UAE and it has MORE chokepoints without alternatives."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186399426,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186399426",
      "commentDateMs": 1765397950273,
      "likes": 0,
      "text": "22. I strongly suspect you're overestimating the yearning for regulation, especially regulation made in California that has national effects. I in general have a low opinion of that cohort's political instincts. But we'll see I suppose."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186399804,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186399804",
      "commentDateMs": 1765398010356,
      "likes": 0,
      "text": "23. I've heard this accusation made. I originally said I've been consistent on this. But I've now realized: so is everyone else in this camp that I know. So can you point to anyone who wants a lack of AI regulation but also wants to sell the chips to China? David Sacks wanted the Federal pre-emption and a regulatory structure like the one he made for crypto. So he doesn't count. Who else?"
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/links-for-december-2025",
      "postTitle": "Links For December 2025",
      "postId": 180777884,
      "commentId": 186400523,
      "commentUrl": "https://www.astralcodexten.com/p/links-for-december-2025/comment/186400523",
      "commentDateMs": 1765398125099,
      "likes": 0,
      "text": "52. Generally speaking, apocalypse cults do not claim everything will mostly stay the same. Apocalypse is kind of a load bearing part of the claim. You can I guess claim almost everyone is in a \"things will mostly continue roughly as they have before\" cult and have been for much of history. This is actually kind of important to understand the cyclical nature of premodern society in particular, before the cultural idea of technological progress had really been invented."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted",
      "postTitle": "Vibecession: Much More Than You Wanted To Know",
      "postId": 179630044,
      "commentId": 184216794,
      "commentUrl": "https://www.astralcodexten.com/p/vibecession-much-more-than-you-wanted/comment/184216794",
      "commentDateMs": 1764872105743,
      "likes": 0,
      "text": "I think I figured out something which explains it: if you disaggregate you find that what happened is that the medians/averages conceal massively uneven statistics. Redistribution by the Democrats such that things got better for classes that benefitted from government spending (mainly those in NGO world, climate companies, government employees, teachers, small businesses eligible for grants which were disproportionately women/minorities, etc) and worse for everyone else. I suspect this was a big driver. Inflation was effectively a universal tax which was then redistributed by Democrat rescue packages to their constituencies. Which they in effect said: that they were targeting help at the vulnerable who were, for the most part, by historical disadvantage (ie, Democratic priorities) rather than needs based. They explicitly said they saw it as a way to reduce disparities. It doesn't help they got very indulgent with targeted giveaways even to their rich constituents (SALT, student debt). This naturally upset everyone not on the receiving end of such largesse who saw real loss of purchasing power. The Democrats basically gave themselves credit for aggregate statistics and thought they could ignore the people who were losing from their policies because they were politically disfavored. This seems to be a common malady in their decision making which Bill Clinton and Obama have both commented on. We're seeing a similar thing with Trump's policies right now, by the way. Different specifics but still."
    },
    {
      "postUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose",
      "postTitle": "Why AI Safety Won't Make America Lose The Race With China",
      "postId": 177641137,
      "commentId": 181272833,
      "commentUrl": "https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose/comment/181272833",
      "commentDateMs": 1764123125875,
      "likes": 0,
      "text": "> The Chinese don’t really believe in recursive self-improvement or superintelligence. Good to see you now agree that rationalist AI risk is a niche concern compared to other forms of AI risk about concerns like political control. China actually has an extremely robust AI risk infrastructure meant to prevent it from harming the government. Has the fact that AI risk almost invariably has turned to political control made you rethink your positions at all? This isn't a gotcha, I genuinely find the degree to which the AI Risk community seems to not engage with this kind of stuff frustrating and if you want to point me to the smart rationalists who have thought about other ideologies in the space I'd be curious to read it. > Is there a risk that the next generation of AI safety regulations will be more burdensome? From what I hear, if we win this round beyond our expectations, the next generation of AI safety asks is third-party safety auditing and location verification for chips. I don’t know the exact details, but these don’t seem order-of-magnitude worse than the current bills. Maybe another 1%. This is MUCH MUCH more burdensome than another 1% and would require re-engineering the entire way chip sales and data centers work. The fact this is casually suggested without taking that into account does not inspire confidence. Though there's a chance we're going to do that anyway as part of an export control regime. It's not that I think it's not doable but the fact this is where you ended up as a cost estimate is a red flag to me. > Most people who discuss this want a mutual pause. You suggested a unilateral pause in the comments of this blog. Are you willing to now commit to not supporting any unilateral pause? Because I'm not opposed to some form of cooperation. But I'm absolutely opposed to a unilateral pause. > Consider AI ethics regulations like the Colorado AI Act of 2024. It legislates that any institution which uses AI to make decisions (schools, hospitals, businesses, etc) must perform yearly impact assessments evaluating whether the models might engage in “algorithmic discrimination”, a poorly-defined concept from the 2010s that doesn’t really make sense in reference to modern language models. > If the US knows about Chinese chip smuggling strategies, why can’t it crack down? This is something I don't understand from a political perspective. There's multiple groups trying to constrain AI in various ways. Many of them are far more powerful than rationalists. The degree to which rationalists seem to not realize this is happening is baffling to me. Obviously the answer would be to hitch the relatively niche, unpopular policies they want to a wider vehicle that does have a larger support base. > Yet some of the loudest voices warning against AI safety regulation on “race with China” grounds support NVIDIA chip exports! For what it's worth this doesn't apply to me. > But I’ll go further and say it’s too early even to know what the sign of AI safety regulations is; whether they might actually speed us up relative to China. This has been tried by Europe. It did not work. This doesn't mean in principle it can't work. But it means you have a very heavy burden of proof. > Third, China is having its own debate over whether it can prioritize safety without losing the race against America! Kind of. There are people quietly pointing out that political restrictions are causing issues. Sometimes they win a little but ultimately security leads all right now. Also, don't underestimate the degree to which China will consciously manipulate foreign movements to serve its own goals. The individual Chinese scientists might be entirely sincere, in fact the whole organization might be, but the government might fund and push them forward with explicitly political motives. There is an easy test though: make sure they are not asking for unilateral concessions where you pause or limit yourself for future promises China will \"follow along\" or other such things. Which is tempting because they will point out how China's system makes influence harder. Which is true but is being weaponized in that case. > When the wind changes, and the position of industry leaders changes with it, you may be glad to have us around. The Biden Executive Order and the general work of Democratic staffers has not inspired confidence. Your movement, such as it is, should be producing competent staffers that can go into government and coordinating political organizations to mobilize votes and donations and other such candidate support. I have not seen this."
    }
  ]
}